# IsOpen Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveLoop..::..IsOpen Method
CurveLoop Class See Also
---
Returns whether the curve loop is open or closed, as determined by an internal flag.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsOpen()
```

Visual Basic
---
```text
Public Function IsOpen As Boolean
```

Visual C++
---
```text
public:
bool IsOpen()
```

# ### Return Value
True if the CurveLoop is marked open, false if marked closed.
# Remarks
Some routines in Revit may set the CurveLoop to be marked "open" or "closed" in spite of the actual geometry of the curves. In these special cases, the CurveLoop class does not require that the CurveLoop is correctly marked.
# See Also
CurveLoop Class
Autodesk.Revit.DB Namespace